_Rarzrabotki/Rarus/USO2/Documents/УСОERP_УчетВыполненныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_УчетВыполненныхРабот</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УСОERP_УчетВыполненныхРабот</xr:Item>
				<xr:Item>AccumulationRegister.УСОERP_УчетПриемаРеализацииРабот</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВидыОперацийУчетаВыполненныхРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПланов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУтверждения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_УтверждениеКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемВсего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаОбъема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Длительность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаДлительности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентВыполнения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентВыполненияНаНачалоПериода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемНаНачалоПериода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/AccumulationRegisters/УСОERP_УчетВыполненныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>УСОERP_УчетВыполненныхРабот</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЕдиницаОбъема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаДлительности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ВидыОперацийУчетаВыполненныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ВидыОперацийУчетаВыполненныхРабот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыполнениеСобственнымиСилами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнениеСиламиСубподрядчика</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_УчетВыполненныхРабот/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеСвойствПоСтатистикеСервер.ЗаполнитьСвойстваОбъекта(ЭтотОбъект, ДанныеЗаполнения);	
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидОперации = Перечисления.УСОERP_ВидыОперацийУчетаВыполненныхРабот.ВыполнениеСобственнымиСилами Тогда 
		ПроверяемыеРеквизиты.Добавить("Подраздление");
	ИначеЕсли ВидОперации = Перечисления.УСОERP_ВидыОперацийУчетаВыполненныхРабот.ВыполнениеСиламиСубподрядчика Тогда
		ПроверяемыеРеквизиты.Добавить("Партнер");
		ПроверяемыеРеквизиты.Добавить("Контрагент");
	КонецЕсли;
	
	Для ТекИндекс = 0 По Работы.Количество()-1 Цикл
		АдресОшибки = НСтр("ru=' в строке %НомерСтроки% списка ""Работы""'");
		АдресОшибки = СтрЗаменить(АдресОшибки, "%НомерСтроки%", Работы[ТекИндекс].НомерСтроки);
		
		Если Не УСОERP_УправлениеСтроительнымПроизводством.ЭтоСуммарнаяРабота(Работы[ТекИндекс].Работа) 
			И Не ЗначениеЗаполнено(Работы[ТекИндекс].Объем) Тогда
			
			ТекстОшибки = НСтр("ru='Не заполнено поле ""Объем""'");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки + АдресОшибки,
				ЭтотОбъект,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Работы", Работы[ТекИндекс].НомерСтроки, "Объем"),
				,
				Отказ);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НаправлениеДеятельности) Тогда
		НаправлениеДеятельности = ДокументУтверждения.НаправлениеДеятельности;
	КонецЕсли;
		
	ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);

	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ПроверитьОбъемыРабот(Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	// все не суммарные работы
	НеСуммарныеРаботы = Новый СписокЗначений;
	Для каждого ТекСтрока Из Работы Цикл
		ЭтоСуммарнаяРабота = УСОERP_УправлениеСтроительнымПроизводством.ЭтоСуммарнаяРабота(ТекСтрока.Работа);
		Если Не ЭтоСуммарнаяРабота Тогда
			НеСуммарныеРаботы.Добавить(ТекСтрока.Работа);
		КонецЕсли;
	КонецЦикла; 
	
	Документы.УСОERP_УчетВыполненныхРабот.ИнициализироватьДанныеДокумента(Ссылка,ДополнительныеСвойства);  	
	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	УСОERP_УправлениеСтроительнымПроизводством.ОтразитьДвиженияУчетВыполненыхРабот(ДополнительныеСвойства, Движения, Отказ);
	
	СформироватьСписокРегистровДляКонтроля(); 
	
	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);    
	
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	СформироватьСписокРегистровДляКонтроля();
	
	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	
	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьДокумент();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка ИЛИ ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Инициализация

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Ответственный        = Пользователи.ТекущийПользователь();
	Организация          = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	ДатаНачалаПериода	 = НачалоМесяца(ТекущаяДата());
	ДатаОкончанияПериода = КонецМесяца(ТекущаяДата());
	
КонецПроцедуры

Процедура СформироватьСписокРегистровДляКонтроля()

	Массив = Новый Массив;
	
	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	КонецЕсли;
	
	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);
	
КонецПроцедуры

#КонецОбласти

Процедура ПроверитьОбъемыРабот(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабРаботы.НомерСтроки КАК НомерСтроки,
	|	ВЫРАЗИТЬ(ТабРаботы.Работа КАК Справочник.УСОERP_СтроительныеРаботы) КАК Работа,
	|	ВЫРАЗИТЬ(ТабРаботы.РаботаИсточник КАК Справочник.УСОERP_СтроительныеРаботы) КАК РаботаИсточник,
	|	ТабРаботы.ОбъемВсего КАК ОбъемВсего,
	|	ТабРаботы.ЕдиницаОбъема КАК ЕдиницаОбъема,
	|	ТабРаботы.Объем КАК Объем,
	|	ТабРаботы.ПроцентВыполненияНаНачалоПериода КАК ПроцентВыполненияНаНачалоПериода
	|ПОМЕСТИТЬ ВТ_РаботыДокумента
	|ИЗ
	|	&Работы КАК ТабРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УСОERP_УчетВыполненныхРаботОбороты.Работа КАК Работа,
	|	СУММА(УСОERP_УчетВыполненныхРаботОбороты.ОбъемПриход) КАК ОбъемПринято
	|ПОМЕСТИТЬ ВТ_ПринятыеОбъемы
	|ИЗ
	|	РегистрНакопления.УСОERP_УчетВыполненныхРабот.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			Работа В
	|					(ВЫБРАТЬ
	|						ВТ_РаботыДокумента.РаботаИсточник
	|					ИЗ
	|						ВТ_РаботыДокумента КАК ВТ_РаботыДокумента)
	|				И Организация = &Организация
	|				И ОбъектСтроительства = &ОбъектСтроительства) КАК УСОERP_УчетВыполненныхРаботОбороты
	|ГДЕ
	|	НЕ УСОERP_УчетВыполненныхРаботОбороты.Регистратор В (&Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	УСОERP_УчетВыполненныхРаботОбороты.Работа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РаботыДокумента.НомерСтроки КАК НомерСтроки,
	|	ВТ_РаботыДокумента.Работа КАК Работа,
	|	ВТ_РаботыДокумента.Работа.КодСДР КАК КодСДР
	|ИЗ
	|	ВТ_РаботыДокумента КАК ВТ_РаботыДокумента
	|ГДЕ
	|	ВТ_РаботыДокумента.ПроцентВыполненияНаНачалоПериода >= 100
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_РаботыДокумента.НомерСтроки КАК НомерСтроки,
	|	ВТ_РаботыДокумента.Работа.КодСДР КАК КодСДР,
	|	ВТ_РаботыДокумента.Работа КАК Работа,
	|	ВТ_РаботыДокумента.ОбъемВсего КАК ОбъемВсего,
	|	ВТ_РаботыДокумента.ЕдиницаОбъема КАК ЕдиницаОбъема,
	|	ВТ_РаботыДокумента.Объем КАК Объем,
	|	ВТ_ПринятыеОбъемы.ОбъемПринято КАК ОбъемПринято,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_РаботыДокумента.Объем, 0) > ЕСТЬNULL(ВТ_РаботыДокумента.ОбъемВсего, 0) - ЕСТЬNULL(ВТ_ПринятыеОбъемы.ОбъемПринято, 0)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОшибкаПревышениеОбъема,
	|	ЕСТЬNULL(ВТ_РаботыДокумента.ОбъемВсего, 0) - ЕСТЬNULL(ВТ_ПринятыеОбъемы.ОбъемПринято, 0) КАК ОбъемДоступноКПриему
	|ИЗ
	|	ВТ_РаботыДокумента КАК ВТ_РаботыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПринятыеОбъемы КАК ВТ_ПринятыеОбъемы
	|		ПО ВТ_РаботыДокумента.РаботаИсточник = ВТ_ПринятыеОбъемы.Работа
	|ГДЕ
	|	ЕСТЬNULL(ВТ_РаботыДокумента.Объем, 0) > ЕСТЬNULL(ВТ_РаботыДокумента.ОбъемВсего, 0) - ЕСТЬNULL(ВТ_ПринятыеОбъемы.ОбъемПринято, 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	ТЗРаботы = Работы.Выгрузить();
	ТЗРаботы.Колонки.Добавить("РаботаИсточник",Новый ОписаниеТипов("СправочникСсылка.УСОERP_СтроительныеРаботы"));
	Для Каждого СтрокаТЗ ИЗ ТЗРаботы Цикл
	   СтрокаТЗ.РаботаИсточник = ?(ЗначениеЗаполнено(СтрокаТЗ.Работа.РаботаИсточник),СтрокаТЗ.Работа.РаботаИсточник,СтрокаТЗ.Работа);
   КонецЦикла;
   
	Запрос.УстановитьПараметр("Работы", 				ТЗРаботы);
	Запрос.УстановитьПараметр("Организация", 			Организация);
	Запрос.УстановитьПараметр("ОбъектСтроительства", 	ОбъектСтроительства);
	Запрос.УстановитьПараметр("Ссылка",					Ссылка);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	Выборка  = ПакетЗапросов[2].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПутьКДанным = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Работы", Выборка.НомерСтроки, "ПроцентВыполненияНаНачалоПериода");
		
		ТекстСообщения = "По работе "+СокрЛП(Выборка.КодСДР)+" "+СокрЛП(Выборка.Работа)+" уже выполнено 100%";
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ЭтотОбъект.Ссылка,,ПутьКДанным,Отказ);
		
	КонецЦикла; 	
	
	Выборка = ПакетЗапросов[3].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПутьКДанным = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Работы", Выборка.НомерСтроки, "Объем");
		ТекстСообщения = 
		"Для работы "+СокрЛП(Выборка.КодСДР)+" "+СокрЛП(Выборка.Работа)+
		" указанный объем " + Строка(Выборка.Объем) + " " + Выборка.ЕдиницаОбъема +
		" превышает допустимый остаток объема выполнения: " +
		" объем работы общий - " + Строка(Выборка.ОбъемВсего) + " " + Выборка.ЕдиницаОбъема +
		", объем выполненный - " + Строка(Выборка.ОбъемПринято) + " " + Выборка.ЕдиницаОбъема + ".";  
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ЭтотОбъект.Ссылка,, ПутьКДанным,Отказ); 
		
	КонецЦикла;
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
